#Імортування модуля re
import re
raw_numbers = [
    "067\\t123 4567",
    "(095) 234-5678\\n",
    "+380 44 123 4567",
    "380501234567",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050 111 22 11   ",
]
def normalize_phone(num):
#Створення функції, в якому паттерн виокремлює все, окрім цифр та замінюється на пустоту, тобто видаляється
    numbers = re.sub(r'[^\d]', '', num)
#Перевірка, якщо довжина отриманого номера 12 цифр - додається +, а якщо 10 - то +38. Інакше - неправильний формат
    if len(numbers) == 12:
        return '+' + numbers
    elif len(numbers) == 10:
        return '+38' + numbers
    else:
        return 'Неправильний формат'
#Перевірка результатів
numbers = [normalize_phone(num) for num in raw_numbers]
print(numbers)

